{
    "dateStamp": "2025-10-27T00:00:00Z",
    "cloudPosts":[{"postType":"post","studyLevel":"beginner","postPlatform":"youtube","additionalText":"","intro":"В этом видео я расскажу вам обо всех оболочках, которые нам предлагает SwiftUI для хранения временных данных. Так же вы поймете, в чем отличие между такими оболочки как @State, @StateObject, @ObservedObject, @EnvironmentObject. Эти оболочки очень похожи друг на друга и знание того, когда и какую лучше использовать, имеет решающее значение.","id":"0CACF074-5C29-414C-9FF3-847CA532E522","author":"Evgenia Bruyko","urlString":"https:\/\/youtu.be\/ExwwrvOT8mI?si=SU__YwU8UlR461Zb","title":"Property Wrappers","postDate":"2021-03-26T00:00:00Z","favoriteChoice":"no"},{"postType":"post","studyLevel":"middle","postPlatform":"youtube","additionalText":"","intro":"In this video we are going to explore how we can stylize text for our Text views in SwiftUI.\nWe will start by looking at how we can create a `Text` view with the Markdown-formatted base postLanguage version of the string as the localization key,\nWe will also see how we can utilize string interpolation to combine and stylize our strings and present them in a text view.\nAnd finally, we will take a quick look at the power of Attributed strings in SwiftUI.","id":"B9D29619-6C2A-4761-AF16-C0083781BE97","author":"Stewart Lynch","urlString":"https:\/\/www.youtube.com\/watch?v=rbtIcKKxQ38","title":"Styling SwiftUI Text Views","postDate":"2021-05-07T00:00:00Z","favoriteChoice":"no"},{"postType":"post","studyLevel":"beginner","postPlatform":"website","additionalText":"","intro":"Symbol images are vector-based icons from Apple's SF Symbols library, designed for use across Apple platforms. These scalable images adapt to different sizes and weights, ensuring consistent, high-quality icons throughout our apps. Using symbol images in SwiftUI is straightforward with the Image view and the system name of the desired symbol.","id":"4B152105-AD88-4C8C-8594-7BC2DCA5D0FD","author":"Natalia Panferova","urlString":"https:\/\/nilcoalescing.com\/blog\/CustomizingTheAppearanceOfSymbolImagesInSwiftUI\/","title":"Customizing the appearance of symbol images in SwiftUI","postDate":"2024-09-22T00:00:00Z","favoriteChoice":"no"},{"postType":"post","studyLevel":"advanced","postPlatform":"website","additionalText":"","intro":"ViewBuilders in SwiftUI are an excellent way to keep your code clean and organized. They make your code easier to read and maintain by allowing you to structure your views more clearly. This simplifies the process of building complex user interfaces, ensuring that your code remains elegant and efficient. Embracing ViewBuilders enhances both the readability and manageability of your SwiftUI projects.","id":"AB8740AC-C812-4632-95A0-B42CDEBE6C3F","author":"softwareanders.com","urlString":"https:\/\/softwareanders.com\/swiftui-viewbuilder-organize-your-views\/","title":"ViewBuilder: Organize your views","postDate":"2024-06-27T00:00:00Z","favoriteChoice":"no"},{"postType":"post","studyLevel":"beginner","postPlatform":"website","additionalText":"","intro":"clipShape is a SwiftUI modifier that allows developers to define a shape that clips a view to shape it. This means that the view will be confined to the defined shape. You can create anything from circles to rectangles, it’s up to you.\n                \nIn this post you will learn about ClipShape in SwiftUI. You will learn how to implement them and we will also cover the different shapes available.","id":"5CD14655-49CF-46CB-9DD0-B31376FA3750","author":"softwareanders.com","urlString":"https:\/\/softwareanders.com\/swiftui-clipshape-shape-your-application\/","title":"ClipShape: Shape Your Application","postDate":"2024-06-13T00:00:00Z","favoriteChoice":"no"},{"studyLevel":"beginner","postType":"post","intro":"The Long Press gesture in SwiftUI is a powerful interaction that triggers when a user presses and holds a view for a specific duration. This essential gesture recognizer is frequently implemented in modern iOS apps for context menus, drag and drop functionality, or revealing additional information to enhance user experience.","postPlatform":"website","id":"213FBE0B-5E9C-4E13-B6F9-1A54B5E7CAA6","postDate":"2024-05-07T00:00:00Z","additionalText":"","urlString":"https:\/\/softwareanders.com\/swiftui-long-press-how-to-guide\/","title":"Long Press Gesture: Complete How-To Guide","author":"softwareanders.com","favoriteChoice":"no"},{"studyLevel":"beginner","postType":"post","intro":"SwiftUI Toggle is a UI control that enables users to switch between two states, typically represented as on and off. If you are building a view where you can enable a feature, then the Toggle view is the way to go.\n\nWith very little code you can implement a simple and effective way of getting user input. In this blog post we will cover how to implement a Toggle switch, change the color, hide the label and execute a function when turned on.","postPlatform":"website","id":"18E70CFD-928C-4C5F-91EC-AF03CE86BB3A","postDate":"2024-05-02T00:00:00Z","additionalText":"","urlString":"https:\/\/softwareanders.com\/swiftui-toggle-turn-on-and-off\/","title":"Toggle: Turn On And Off","author":"softwareanders.com","favoriteChoice":"no"},{"studyLevel":"beginner","postType":"post","intro":"SF Symbols is a great solution for making visual tasks with developing an iOS application. Not only are they great, but there are so many different ones to choose from. If you want to make your SF Symbols stand out a bit more or create some kind of visual effect, then animating your SF Symbols is the way to go.\n\nIn the following examples, we will discover different variations of animations, so you are ready to animate your SF Symbols.","postPlatform":"website","id":"157C09FF-E3CB-4ED8-AAEF-139F2B522D38","postDate":"2024-04-24T00:00:00Z","additionalText":"","urlString":"https:\/\/softwareanders.com\/swiftui-animate-sf-symbols\/","title":"Animate SF Symbols","author":"softwareanders.com","favoriteChoice":"no"},{"author":"softwareanders.com","postType":"post","id":"5207C6BE-8988-4238-8538-1BF8DFC13769","postPlatform":"website","intro":"Shadows can add depth, dimension, and a touch of realism to your application.\n\nIn this blog post, we will discover how to use the shadow() modifier in effect on any view in SwiftUI and we will also cover how you can customize the shadow effect.","postDate":"2024-04-03T00:00:00Z","title":"Shadow: Create depth and dimension","studyLevel":"beginner","urlString":"https:\/\/softwareanders.com\/swiftui-shadow-create-depth-and-dimension\/","favoriteChoice":"no","additionalText":""},{"author":"softwareanders.com","postType":"post","id":"37AF17CC-424C-4C57-9FF2-DAE5CEA6323F","postPlatform":"website","intro":"No matter what kind of app you are building, if your application has the feature to share data, do yourself a favor and implement ShareLink. Not only is it really easy to implement it also increases useability.\n\nIn this blog post, we’re going to dive into SwiftUI’s ShareLink and how you can share a URL or Image with ease.","postDate":"2024-03-28T00:00:00Z","title":"ShareLink: Share with ease","studyLevel":"beginner","urlString":"https:\/\/softwareanders.com\/swiftui-sharelink-share-with-ease\/","favoriteChoice":"no","additionalText":""},{"author":"softwareanders.com","postType":"post","id":"ED3FBF02-A090-4CC6-AC54-808CF88A9E8F","postPlatform":"website","intro":"In this blog post, we cover how to create a launch screen in SwiftUI, exploring why they’re not just a good idea, but a crucial element in crafting an exceptional user experience.","postDate":"2024-03-21T00:00:00Z","title":"Launch screen: First Impressions Matters","studyLevel":"beginner","urlString":"https:\/\/softwareanders.com\/swiftui-launch-screen-first-impressions-matters\/","favoriteChoice":"no","additionalText":""},{"author":"softwareanders.com","postType":"post","id":"BEFF6C40-7050-45CD-841D-A911D612BF5E","postPlatform":"website","intro":"Most applications nowadays use the internet. Whether you’re developing an application for the sole purpose of checking the network connection or simply trying to optimize user experience, knowing how to check network connectivity in your Swift application can be a game-changer.\n\nIn this guide, we will check the network connection inside a SwiftUI application using NWPathMonitor, which was introduced in iOS 12.\n\nNB: Before diving into this guide, it’s a good idea to test on an iPhone and not the simulator.","postDate":"2024-03-28T00:00:00Z","title":"Swift check network connection","studyLevel":"beginner","urlString":"https:\/\/softwareanders.com\/swift-check-network-connection\/","favoriteChoice":"no","additionalText":""},{"author":"softwareanders.com","postType":"post","id":"2397343F-D15E-433C-A65A-12BD4B48C822","postPlatform":"website","intro":"This article provides insights into the SwiftUI implementation of review requests, offering practical guidance on code usage and adherence to Apple’s best practices for soliciting feedback effectively.\n\nIn this blog post we will cover how to request a review in SwitUI, we will also cover best practices on when to ask for a review and Apple’s guidelines.","postDate":"2024-02-22T00:00:00Z","title":"Request review: Complete guide","studyLevel":"middle","urlString":"https:\/\/softwareanders.com\/swiftui-request-review-complete-guide\/","favoriteChoice":"no","additionalText":""},{"postType":"post","title":"Segmented control: Easy to follow guide","author":"softwareanders.com","postPlatform":"website","postDate":"2024-02-21T00:00:00Z","intro":"SwiftUI Segmented Control is a great and user-friendly way that allows users to choose between multiple options within a segmented, tap-friendly control.\n\nIn this blog post, we’ll learn how to create a Segmented Control in SwiftUI and explore how to change the selected color and background color.","studyLevel":"beginner","id":"64AF8976-7B29-4334-83E0-351C0989AAD7","favoriteChoice":"no","additionalText":"","urlString":"https:\/\/softwareanders.com\/swiftui-segmented-control\/"},{"postType":"post","title":"Email: A Complete Guide","author":"softwareanders.com","postPlatform":"website","postDate":"2024-03-12T00:00:00Z","intro":"In today’s digital landscape, email remains a cornerstone of communication, seamlessly connecting users worldwide. This guide caters to developers of all skill levels, offering a concise walkthrough from project setup to email composition and dispatch within your SwiftUI app.\n\nIn this blog post, we’ll explore how to send emails using SwiftUI, both with and without an attachment.","studyLevel":"beginner","id":"B981A4F1-B132-404D-9291-815AD3A73E4C","favoriteChoice":"no","additionalText":"","urlString":"https:\/\/softwareanders.com\/swiftui-email-a-complete-guide\/"},{"postType":"post","title":"Material: How to use material","author":"softwareanders.com","postPlatform":"website","postDate":"2024-01-14T00:00:00Z","intro":"When you want to create a blurred background, you should differently use SwiftUI material. Material was launched in SwiftUI 3 and is a great way of making a blurred background or see through view, Apple has provided an easy way of making a blur effect as a background.\n\nIn this blog post, you will learn what Material is and how you use it and we will create an example with a view where we use material.","studyLevel":"beginner","id":"AD7081D6-63A6-4491-AA2A-0A7426C8854A","favoriteChoice":"no","additionalText":"","urlString":"https:\/\/softwareanders.com\/swiftui-material-how-to-use-material\/"},{"postType":"post","title":"Blur: A short guide","author":"softwareanders.com","postPlatform":"website","postDate":"2024-01-11T00:00:00Z","intro":"The blur effect is a visual enhancement technique used in graphic design and user interface development to create a sense of depth, focus, or aesthetic appeal.\n\nIn SwiftUI, the blur effect is achieved using the blur modifier. This modifier allows developers to apply a blur to any SwiftUI view.","studyLevel":"beginner","id":"4AE6BEEE-036D-4AE6-B07C-1FC9C8630741","favoriteChoice":"no","additionalText":"","urlString":"https:\/\/softwareanders.com\/swiftui-blur-a-short-guide\/"},{"postType":"post","title":"Pull to refresh: Easy guide","author":"softwareanders.com","postPlatform":"website","postDate":"2023-12-29T00:00:00Z","intro":"SwiftUI Pull-to-Refresh is an essential feature in most apps, people just expect to be able to pull to refresh on lists of data. Pull to refresh allows users to update content effortlessly by pulling down on a view. \n\nIn this blog post, we will explore the implementation of SwiftUI Pull to Refresh, its benefits, and the steps to integrate this feature into your application.","studyLevel":"beginner","id":"0D0EB492-6D81-42FE-AF93-9FD9EC3B87FE","favoriteChoice":"no","additionalText":"","urlString":"https:\/\/softwareanders.com\/swiftui-pull-to-refresh-easy-guide\/"},{"postType":"post","title":"Link: How to guide","author":"softwareanders.com","postPlatform":"website","postDate":"2023-12-28T00:00:00Z","intro":"Link is a great and hassle-free way of opening a website from your application. In this article, we will cover how you use SwiftUI Link and how you can customize it to fit inside your application.","studyLevel":"beginner","id":"09F18D6B-EB2B-4BFB-A3CA-2380A5046C53","favoriteChoice":"no","additionalText":"","urlString":"https:\/\/softwareanders.com\/swiftui-link-how-to-guide\/"},{"postType":"post","title":"Divider: A powerful line","author":"softwareanders.com","postPlatform":"website","postDate":"2023-12-20T00:00:00Z","intro":"SwiftUI divider is a simple yet powerful element that plays a crucial role in crafting visually appealing and well-structured interfaces. \n\nIn this blog post, we’ll explore the SwiftUI Divider and how it can elevate your app’s design and how to customize it to fit in your application.","studyLevel":"beginner","id":"4B64990E-2EC6-4A28-9B8D-0A389327AF8D","favoriteChoice":"no","additionalText":"","urlString":"https:\/\/softwareanders.com\/swiftui-divider-a-powerful-line\/"},{"postType":"post","title":"Swift convert strings into different data types: Easy guide","author":"softwareanders.com","postPlatform":"website","postDate":"2023-12-08T00:00:00Z","intro":"As a software developer, you often encounter scenarios where you need to convert data from one type to another, and string conversion is a fundamental skill to master. \n\nIn this blog post, we’ll explore the art of converting strings into different data types like int, date, double and you will also learn how to convert your strings and prevent your app from crashing if it’s a wrong data type.","studyLevel":"beginner","id":"EA50A2A9-92F6-4E4E-A9C4-A92DB98D9370","favoriteChoice":"no","additionalText":"","urlString":"https:\/\/softwareanders.com\/converting-strings-into-different-data-types-easy-guide\/"},{"postType":"post","title":"ColorPicker: A complete guide to Color Selection","author":"softwareanders.com","postPlatform":"website","postDate":"2023-11-28T00:00:00Z","intro":"SwiftUI ColorPicker enhances the user experience by providing an interactive and visually pleasing way to select colors. \n\nIn this blog post dive into the SwiftUI ColorPicker, exploring its functionality and how it simplifies the process of color selection within your SwiftUI applications.","studyLevel":"beginner","id":"E18257D0-15FE-412E-9C42-44AC3AED91B5","favoriteChoice":"no","additionalText":"","urlString":"https:\/\/softwareanders.com\/swiftui-colorpicker-a-complete-guide-to-color-selection\/"},{"postType":"post","title":"Swipe Actions: Complete guide with examples","author":"softwareanders.com","postPlatform":"website","postDate":"2023-11-27T00:00:00Z","intro":"One awesome and helpful feature in SwiftUI that enhances user interaction is swipe actions. In this blog post, we’ll explore the world of SwiftUI swipe actions, we will learn how to implement them and customize them to fit into your application, so you can provide even more value for your users.","studyLevel":"beginner","id":"4582EEE2-AA62-4390-9353-91EFE6278232","favoriteChoice":"no","additionalText":"","urlString":"https:\/\/softwareanders.com\/swiftui-swipe-actions-complete-guide-with-examples\/"},{"postType":"post","title":"SF Symbols: A easy guide","author":"softwareanders.com","postPlatform":"website","postDate":"2023-11-23T00:00:00Z","intro":"SwiftUI SF Symbols stand out as a powerful tool for enhancing the visual appeal of your apps. These symbols, introduced by Apple, provide a vast collection of scalable, customizable icons that can breathe life into your user interface. \n\nIn this blog post, we’ll explore how to implement SwiftUI SF Symbols and dive into how they can be customized to fit your needs.","studyLevel":"beginner","id":"85B717A5-EEBA-450E-BBA5-027EDB6D2E00","favoriteChoice":"no","additionalText":"","urlString":"https:\/\/softwareanders.com\/swiftui-sf-symbols-a-easy-guide\/"},{"postType":"post","title":"DatePicker: Integrating dates in your app","author":"softwareanders.com","postPlatform":"website","postDate":"2023-11-21T00:00:00Z","intro":"SwiftUI DatePicker is a powerful tool that simplifies date and time selection in your iOS apps. The SwiftUI DatePicker provides a seamless way for users to choose dates and times within your app, eliminating the need for complex input forms or manual date entry. With a sleek and customizable interface, this component enhances the user experience and streamlines the development process.\n\nIn this blog post, you will learn how to use the DatePicker in SwiftUI and how to customize it so it fits right into the style of your application.","studyLevel":"beginner","id":"1BF4FF0A-FFF5-402F-95B4-AA7CED828B63","favoriteChoice":"no","additionalText":"","urlString":"https:\/\/softwareanders.com\/swiftui-datepicker-integrating-dates-in-your-app\/"},{"postType":"post","title":"TextEditor character limit","author":"softwareanders.com","postPlatform":"website","postDate":"2023-11-09T00:00:00Z","intro":"SwfitUI TextEditor is a great tool for letting your users edit large text elements, but sometimes you want to limit the character count — your backend API might have a limit. For example, Twitter (now X) has a character limit of 280.\n\nIn this blog post, you will learn how to create a TextEditor with a limit of 280 characters. We’ll create the TextEditor in its own view so you can easily use it in different places inside your application. We will also create the character limit as a custom modifier — that way you can have different text editors with different limits.","studyLevel":"beginner","id":"AD73BC7F-F410-487C-8E28-6680088D61BE","favoriteChoice":"no","additionalText":"","urlString":"https:\/\/softwareanders.com\/swiftui-texteditor-character-limit\/"},{"postType":"post","title":"TextEditor: A user friendly guide","author":"softwareanders.com","postPlatform":"website","postDate":"2023-11-07T00:00:00Z","intro":"SwiftUI TextEditor is a great component that empowers developers to work with large text input and editing in SwiftUI applications. TextEditor is a dynamic, rich, and customisable solution that offers a world of possibilities for crafting engaging user interfaces.\n\nIn this blog post, we’re going to take a deep dive into SwiftUI TextEditor, exploring its features, capabilities, and how you can use it in your application. I hope that whether you’re new to SwiftUI or a seasoned developer, this guide will provide you with insights and practical examples to unlock the full potential of TextEditor in your projects.","studyLevel":"beginner","id":"FF6B2655-7901-4386-A35C-091ECF15E952","favoriteChoice":"no","additionalText":"","urlString":""},{"postType":"post","title":"Line chart: Complete guide with examples","author":"softwareanders.com","postPlatform":"website","postDate":"2023-10-11T00:00:00Z","intro":"SwiftUI Line chart is a great tool to use. A line chart, also known as a line graph or a time series chart, is a type of data visualization that displays information as a series of data points connected by straight lines. It is commonly used to represent data that changes continuously over a period of time, making it an effective tool for visualising trends, patterns, and relationships in data.\n\nIn SwiftUI it’s easy to make a line chart and in this blog post you will learn everything you need to know about line charts in SwiftUI.","studyLevel":"beginner","id":"0817BE7E-1BD6-405A-8C41-339674D76FB8","favoriteChoice":"no","additionalText":"","urlString":"https:\/\/softwareanders.com\/swiftui-line-chart-complete-guide-with-examples\/"},{"postType":"post","title":"TabView: All you need to know","author":"softwareanders.com","postPlatform":"website","postDate":"2023-10-10T00:00:00Z","intro":"One of the fundamental components for organizing and navigating through content in a mobile application is by using a tabbar at the bottom of the screen. In this blog post, we’ll explore how we can easily create a tabbar in SwiftUI by using the native tabview. \n\nIn this blog post I will provide you with practical examples to help you master the native tabview.","studyLevel":"beginner","id":"34B6C79E-899C-4A5E-A084-2B31758BA9E7","favoriteChoice":"no","additionalText":"","urlString":"https:\/\/softwareanders.com\/swiftui-tabview-all-you-need-to-know\/"},{"postType":"post","title":"Menu: A complete Guide","author":"softwareanders.com","postPlatform":"website","postDate":"2023-08-31T00:00:00Z","intro":"SwiftUI menu provide a seamless and organized way to present actions and options to users and allowing developers to create powerful and interactive interfaces.\n\nIn this post, we will explore various aspects of SwiftUI Menu. We will cover a basic example, add a image to the menu, add a checkmark and more.","studyLevel":"beginner","id":"5D1F2BED-3283-4FF3-BECA-E62B26428B43","favoriteChoice":"no","additionalText":"","urlString":"https:\/\/softwareanders.com\/swiftui-menu-a-complete-guide\/"},{"postType":"post","title":"Toolbar: A complete Guide with examples","author":"softwareanders.com","postPlatform":"website","postDate":"2023-08-24T00:00:00Z","intro":"Toolbar is a powerful tool for designing elegant and functional user interfaces. In this blog post, we’ll be working with the native SwiftUI Toolbar and exploring its capabilities, providing examples, and showing you how to customize things like its background color to match your app’s design.","studyLevel":"beginner","id":"3B7D01E5-0AF6-43EE-9327-232A6FD67CA3","favoriteChoice":"no","additionalText":"","urlString":"https:\/\/softwareanders.com\/swiftui-toolbar-a-complete-guide-with-examples\/"},{"postType":"post","title":"Search: Enhance User Experience with SwiftUI Searchable","author":"softwareanders.com","postPlatform":"website","postDate":"2023-08-22T00:00:00Z","intro":"To create applications that users will love, developers must embrace intuitive design and create a great user experience. When thinking user experience one important note is efficient data presentation. One way of achieving that is by implementing search in SwiftUI. SwiftUI offers a powerful tool for achieving this: the Searchable modifier.\n\nIn this blog post, we’ll dive into SwiftUI Searchable modifier, explore its capabilities, and learn how to search simple strings and complex objects. We will also use search suggestions and search scopes.","studyLevel":"middle","id":"F9770D4C-C285-40F3-AE39-F6A704FA787F","favoriteChoice":"no","additionalText":"","urlString":"https:\/\/softwareanders.com\/swiftui-search-enhance-user-experience-with-swiftui-searchable\/"},{"postType":"post","title":"Swift UserDefaults: All you need to know","author":"softwareanders.com","postPlatform":"website","postDate":"2023-08-15T00:00:00Z","intro":"Swift UserDefaults is a lightweight and convenient data persistence store provided by Apple’s Foundation framework. It allows you to store small pieces of data, such as user preferences, settings, and simple configuration values. These values are automatically saved to the device’s file system, making them accessible even after the app is closed or the device is rebooted.","studyLevel":"beginner","id":"C8C452CC-355B-4985-BF94-B58D5F17822D","favoriteChoice":"no","additionalText":"","urlString":"https:\/\/softwareanders.com\/swift-userdefaults-all-you-need-to-know\/"},{"postType":"post","title":"PhotoPicker: A Hands-On Guide with Examples","author":"softwareanders.com","postPlatform":"website","postDate":"2023-08-10T00:00:00Z","intro":"SwiftUI PhotoPicker is a powerful package for seamlessly integrating photo and media selection capabilities into your applications. \n\nIn this blog post, we’ll dive into how you can implement PhotoPicker and how you let the user pick a single image or select multiple images and of course how you can filter what kind of images they can select.","studyLevel":"beginner","id":"DAFF4C58-910E-4D3E-B98C-11C2A0C62D37","favoriteChoice":"no","additionalText":"","urlString":"https:\/\/softwareanders.com\/swiftui-photopicker-a-hands-on-guide-with-examples\/"},{"postPlatform":"website","id":"FE024520-A800-4516-B174-CA92205C8473","author":"softwareanders.com","studyLevel":"beginner","postType":"post","urlString":"https:\/\/softwareanders.com\/swiftui-confirmationdialog-with-examples\/","intro":"It is important to ensure a smooth and delightful user experience thougth out your app. In iOS 15 Apple have introduced SwiftUI confirmationDialog that can help us with just that. SwiftUI confirmationDialog is a easy way for you as a developer to show a dialog with multiple choices, provide a title and a hint message to make sure your users know what to do. \n\nIn this blog post we will explore what SwiftUI confirmationDialiog is, how it works and give examples on how to use it in your own app.","postDate":"2023-08-08T00:00:00Z","additionalText":"","title":"ConfirmationDialog — with examples","favoriteChoice":"no"},{"postPlatform":"website","id":"B0ECEB77-FF96-4E7C-9C92-76302F01FB02","author":"softwareanders.com","studyLevel":"beginner","postType":"post","urlString":"https:\/\/softwareanders.com\/swiftui-textfield-clear-button\/","intro":"Creating a clear button for a TextField in SwiftUI can greatly enhance the user experience and make your app more user-friendly. This simple feature allows users to easily clear the text within the TextField, eliminating the need to manually delete characters. \n\nA clear button allows users to quickly erase the content of a TextField with a single tap. It eliminates the need to manually delete characters, making it more efficient for users to correct their input or start over.\n\nIn this blog post, I will walk you through the steps of implementing a clear button for a TextField in SwiftUI. You will learn how to quickly add a clear button to one TextField and you will also learn how to create a ViewModifier so you can reuse the solution throughout your app.","postDate":"2023-08-04T00:00:00Z","additionalText":"","title":"TextField clear button","favoriteChoice":"no"},{"postPlatform":"website","id":"A2D78325-5764-4A70-A841-F62F8B562D7F","author":"softwareanders.com","studyLevel":"beginner","postType":"post","urlString":"https:\/\/softwareanders.com\/swiftui-textfield-placeholder-best-practices-and-tips\/","intro":"A well-crafted placeholder can greatly impact the overall user experience. In this blog post, we will explore the importance of TextField placeholders, learn how to change the color of the placeholder, use a image in placeholder and change the font. We will end the blog post with some great tips make better placeholders.","postDate":"2023-08-03T00:00:00Z","additionalText":"","title":"TextField Placeholder: Best Practices and Tips","favoriteChoice":"no"},{"postPlatform":"website","id":"9D6A0DFF-FDB1-4964-BC7C-07F7EDA45DCA","author":"softwareanders.com","studyLevel":"middle","postType":"post","urlString":"https:\/\/softwareanders.com\/swift-eventkit-calendar-management\/","intro":"With Swift EventKit framework it provides powerful capabilities for working with calendars, allowing developers to seamlessly create, edit, fetch and delete calendar events within their applications. \n\nIn this blog post, we will explore a full example of eventkit to create, edit, and delete calendar events, helping users stay organized and on top of their schedules. ","postDate":"2023-07-28T00:00:00Z","additionalText":"","title":"Swift EventKit: Calendar management","favoriteChoice":"no"},{"postPlatform":"website","id":"473F8425-3665-4DC5-B0FD-537B135DF633","author":"softwareanders.com","studyLevel":"beginner","postType":"post","urlString":"https:\/\/softwareanders.com\/swiftui-password-show-and-hide\/","intro":"When creating an app security is very important but so is convenience therefore the ability to show and hide passwords has become a crucial feature for mobile applications. In this blog post, we will explore how to create a secure text field that hides the password but also learn how to create the ability to show\/hide the password.","postDate":"2023-07-26T00:00:00Z","additionalText":"","title":"Password: Show and Hide","favoriteChoice":"no"},{"postPlatform":"website","id":"C32197B7-D290-40E5-8AB8-C78F998A3C36","author":"softwareanders.com","studyLevel":"beginner","postType":"post","urlString":"https:\/\/softwareanders.com\/swiftui-textfield-background-color\/","intro":"In SwiftUI, the TextField is a versatile user interface element that allows users to input text seamlessly. One way to enhance the visual appeal and user experience of TextFields is by customizing their background colors. In this blog post, we’ll delve into different techniques for setting background colors for SwiftUI TextFields and explore creative use cases.\n\nIn this guide about background color for textfield in SwiftUI we will cover the basics but also learn how to set a gradient background and how to change the background based on user input.","postDate":"2023-07-25T00:00:00Z","additionalText":"","title":"TextField Background Color","favoriteChoice":"no"},{"postPlatform":"website","id":"34311A33-8F26-4765-8865-9E5A8D17BF72","author":"softwareanders.com","studyLevel":"beginner","postType":"post","urlString":"https:\/\/softwareanders.com\/swiftui-textfield-a-user-friendly-guide\/","intro":"SwiftUI’s TextField is a powerful user interface element that enables developers to effortlessly capture user input and create interactive experiences in their applications. Whether you’re a seasoned SwiftUI developer or just starting your journey, this blog post will walk you through the ins and outs of SwiftUI TextFields, providing valuable insights, use cases, and code examples along the way. Let’s dive in!","postDate":"2023-07-24T00:00:00Z","additionalText":"","title":"TextField: A User-Friendly Guide","favoriteChoice":"no"},{"postPlatform":"website","id":"35A73594-5F2F-4A3B-8BBD-710DD162254F","author":"softwareanders.com","studyLevel":"beginner","postType":"post","urlString":"https:\/\/softwareanders.com\/swiftui-asyncimage\/","intro":"In the world of mobile app development, displaying images is a common task. However, when dealing with images, it can quickly become tough to display them fast enough while not blocking the UI thread. Luckily Apple have thought of this when creating SwiftUI and they have created a powerful solution called AsyncImage. \n\nIn this blog post, we’ll explore how AsyncImage simplifies the process of loading remote images in SwiftUI, making it easier and more efficient for developers — the easier it is, the happier the developer.","postDate":"2023-06-28T00:00:00Z","additionalText":"","title":"AsyncImage: Asynchronous Image Loading","favoriteChoice":"no"},{"postPlatform":"website","id":"6B459CE9-2559-4BC8-B97D-6E0F59ADCD0B","author":"softwareanders.com","studyLevel":"beginner","postType":"post","urlString":"https:\/\/softwareanders.com\/swiftui-alert\/","intro":"When creating a mobile app it’s important to notify the users when something happens like an API request went OK or failed. With SwiftUI Alerts, you can quickly inform users, gather input, and prompt them to take specific actions. In this article, we’ll explore the power of SwiftUI Alerts and learn how to leverage them to enhance user interaction in your apps.","postDate":"2023-06-29T00:00:00Z","additionalText":"","title":"Alert: Best Practices and Examples","favoriteChoice":"no"},{"postPlatform":"website","id":"1089E039-7827-47C2-9490-C6B30D4FC251","author":"softwareanders.com","studyLevel":"beginner","postType":"post","urlString":"https:\/\/softwareanders.com\/swiftui-navigation-bar-a-complete-guide\/","intro":"Learn how to create and customize a Navigation Bar in SwiftUI — the essential component for effortless app navigation. Discover the power of SwiftUI’s declarative syntax to build modern and visually stunning apps that provide a seamless user experience.\n\nSwiftUI navigation bar is a UI element that allows users to navigate between different views in an app. It is typically used to provide a hierarchical navigation experience, where users can move from a parent view to a child view, and then back to the parent view.","postDate":"2023-06-15T00:00:00Z","additionalText":"","title":"Navigation Bar: A Complete Guide","favoriteChoice":"no"},{"postPlatform":"website","id":"A5BC6FDE-7EAD-4D33-9AEB-ED6A6AA6F889","author":"softwareanders.com","studyLevel":"beginner","postType":"post","urlString":"https:\/\/softwareanders.com\/swiftui-buttons\/","intro":"In the world of iOS app development, SwiftUI has emerged as a powerful framework for building user interfaces. One of its fundamental components is the button. Buttons enable users to interact with your app, triggering actions and providing a seamless user experience. In this blog post, we’ll dive into SwiftUI buttons, exploring their versatility, customization options, and best practices.\n\nBy the end, you’ll be equipped with the knowledge to create beautiful and interactive buttons that elevate your app’s user interface.","postDate":"2023-06-13T00:00:00Z","additionalText":"","title":"Mastering Buttons: A Comprehensive Guide","favoriteChoice":"no"},{"postPlatform":"website","id":"F1AD078E-3DD8-45FC-9C30-CC456F86BD44","author":"softwareanders.com","studyLevel":"beginner","postType":"post","urlString":"https:\/\/softwareanders.com\/swiftui-scrollview-building-dynamic-and-interactive-interfaces\/","intro":"SwiftUI ScrollView is a powerful container view provided by Apple’s SwiftUI framework for creating scrollable user interfaces in iOS, macOS, watchOS, and tvOS applications. It allows users to scroll through views that exceed the screen’s boundaries, providing a seamless and interactive scrolling experience.\n\nThe ScrollView automatically adjusts its content size based on the views it contains, enabling the user to scroll vertically or horizontally through the content. It handles various complexities, such as dynamic content heights, nested scroll views, and lazy loading, making it a versatile tool for building dynamic and interactive user interfaces.","postDate":"2023-06-06T00:00:00Z","additionalText":"","title":"ScrollView: Building Dynamic and Interactive Interfaces","favoriteChoice":"no"},{"postPlatform":"website","id":"DF1C48FC-07E2-40D9-BD06-2B32E397196F","author":"softwareanders.com","studyLevel":"beginner","postType":"post","urlString":"https:\/\/softwareanders.com\/swiftui-picker\/","intro":"The Picker is a powerful and versatile user interface component in SwiftUI that allows users to select an option from a predefined list. In this blog post, we will explore the capabilities of the SwiftUI Picker and how you can leverage its features to enhance your app’s user experience.","postDate":"2023-06-02T00:00:00Z","additionalText":"","title":"Mastering Picker: A Powerful Tool for User Input","favoriteChoice":"no"},{"postPlatform":"website","id":"765DC819-E748-4582-B2D3-4C1E33740BA6","author":"softwareanders.com","studyLevel":"beginner","postType":"post","urlString":"https:\/\/softwareanders.com\/swiftui-rotation-animation\/","intro":"is a powerful framework for building user interfaces in iOS apps. One of the many features it offers is the ability to create animations easily, including rotation animations. In this post, we will explore how to use SwiftUI rotation animation, as well as some use cases and examples.","postDate":"2023-05-16T00:00:00Z","additionalText":"","title":"Rotation Animation: Bringing Your App to Life","favoriteChoice":"no"},{"postPlatform":"website","id":"C917F404-A2DF-4D04-86D9-37B9437A953B","author":"softwareanders.com","studyLevel":"beginner","postType":"post","urlString":"https:\/\/softwareanders.com\/swiftui-redacted\/","intro":"In this article, we’ll explore the power of SwiftUI’s redacted views, including their use cases and examples. You will be able to implement redated in no time","postDate":"2023-05-08T00:00:00Z","additionalText":"","title":"Mastering Redacted: Hide data and show loading","favoriteChoice":"no"},{"postPlatform":"website","id":"5B35FBF9-FFD8-44C4-83C1-E22947D12F8D","author":"softwareanders.com","studyLevel":"beginner","postType":"post","urlString":"https:\/\/softwareanders.com\/swiftui-progressview\/","intro":"As developers, we strive to create applications that are easy to use and visually appealing. Part of achieving this goal is incorporating a user interface that provides clear feedback to the user about the state of the application. One way to achieve this is through the use of progress indicators. In SwiftUI, we have the ProgressView, a view that displays the progress of a task or process. In this post, we’ll explore what ProgressView is, how to use it, and why it’s a good idea.","postDate":"2023-04-12T00:00:00Z","additionalText":"","title":"ProgressView: An Overview","favoriteChoice":"no"},{"postPlatform":"website","id":"0A7FD046-D63B-433E-82A3-F41D820BB895","author":"softwareanders.com","studyLevel":"beginner","postType":"post","urlString":"https:\/\/softwareanders.com\/swiftui-sheet\/","intro":"SwiftUI Sheet is a type of modal presentation style in Apple’s SwiftUI framework for building user interfaces on Apple platforms like iOS, iPadOS, and macOS. \n\nSheets present new content as a slide-over card that covers part of the screen and is used to initiate a task or to present a small amount of content. You can interact with the content on the main screen while the sheet is open. \n\nYou can dismiss the sheet by tapping on the background, dragging it down, or using a specific action. To create a sheet in SwiftUI, use the sheet modifier on a view.","postDate":"2023-04-01T00:00:00Z","additionalText":"","title":"Sheet – with examples","favoriteChoice":"no"},{"postPlatform":"website","id":"26D0D5A8-6708-44D1-AB17-4B0A9C4C9A44","author":"softwareanders.com","studyLevel":"beginner","postType":"post","urlString":"https:\/\/softwareanders.com\/swift-guard-statement-need-to-know-with-examples\/","intro":"In Swift the guard statement is a control flow statement that is used to check for certain conditions, and if those conditions are not met, it will exit the current scope early, returning from the current function, method, or closure.","postDate":"2023-04-01T00:00:00Z","additionalText":"","title":"Swift guard statement — need to know with examples","favoriteChoice":"no"},{"postPlatform":"website","id":"161065CF-95E7-4D6D-9BD7-A7AC7F411B7B","author":"softwareanders.com","studyLevel":"beginner","postType":"post","urlString":"https:\/\/softwareanders.com\/swiftui-stepper-a-powerful-tool-for-user-input-with-examples\/","intro":"User input is an essential part of any application. Without it, apps would be static and unresponsive. To enable user input, developers rely on various tools and widgets to make it as easy and intuitive as possible. One such tool is the SwiftUI Stepper, which allows users to input numerical values in a simple and elegant way.\n\nIn this blog post, we will explore the SwiftUI Stepper, how to use it, and why it’s a good idea to use it in your apps. We’ll also look at some use cases where the Stepper can be useful.","postDate":"2023-03-28T00:00:00Z","additionalText":"","title":"Stepper: A Powerful Tool for User Input — with examples","favoriteChoice":"no"},{"postPlatform":"website","id":"84E92913-8080-4C05-A2C3-BE78676F039B","author":"softwareanders.com","studyLevel":"beginner","postType":"post","urlString":"https:\/\/softwareanders.com\/swiftui-form\/","intro":"One of the most commonly used views in SwiftUI is the Form view, which is a container for grouping related controls and data entry fields in a structured way. In this post, we’ll explore the basics of SwiftUI Form, along with some examples and use cases.","postDate":"2023-03-27T00:00:00Z","additionalText":"","title":"Forms","favoriteChoice":"no"},{"postPlatform":"website","id":"2D7A9B7E-8B13-4BB9-99EE-963EEF54A75D","author":"softwareanders.com","studyLevel":"beginner","postType":"post","urlString":"","intro":"In this tutorial, you will learn how to use List in SwiftUI. I have included the most basic usages of List that includes list with strings, objects, sections, styles, delete, selection and of course pull to refresh.\n\nA List in SwiftUI is a container view that presents rows of data arranged in a single column. It can be used to display a vertically scrolling list of items, where each item is a separate row. A List is a fundamental building block of a SwiftUI app, and it provides several features out-of-the-box, such as automatic scrolling, dynamic row heights, and support for sectioned lists.","postDate":"2023-03-18T00:00:00Z","additionalText":"","title":"List — the basics with examples","favoriteChoice":"no"},{"additionalText":"","favoriteChoice":"no","id":"F49021B0-C05D-4AD5-BA81-087F6D1BA22B","author":"softwareanders.com","studyLevel":"beginner","urlString":"https:\/\/softwareanders.com\/mvvm-in-swiftui-a-easy-guide\/","postType":"post","intro":"MVVM is widely used when developing mobile applications or applications for Windows or Mac. MVVM in swiftUI provides an easy way to separate UI and business logic.\n\nIn this tutorial, you will learn what MVVM is and you will get an example of how to implement it in your SwiftUI app easily.","postDate":"2023-03-16T00:00:00Z","title":"MVVM in SwiftUI — a easy guide","postPlatform":"website"},{"additionalText":"","favoriteChoice":"no","id":"480029A6-D66B-4E06-A36B-D7030908A6A5","author":"softwareanders.com","studyLevel":"beginner","urlString":"https:\/\/softwareanders.com\/swift-error-handling-with-examples\/","postType":"post","intro":"Error handling in Swift is a mechanism for dealing with errors or exceptional situations that may occur in your code. It allows you to identify and respond to potential problems in a controlled and predictable manner, rather than allowing them to cause your program to crash.\n\nIn Swift, errors are represented by values of types that conform to the Error protocol. When a function encounters an error, it can throw an error using the throw statement. The error can then be caught and handled by a surrounding do-catch statement.","postDate":"2023-03-13T00:00:00Z","title":"Swift error handling — with examples","postPlatform":"website"},{"additionalText":"","favoriteChoice":"no","id":"E92FA6CD-7FF6-47C9-91A4-5F8EFD3AF096","author":"Stewart Lynch","studyLevel":"beginner","urlString":"https:\/\/www.youtube.com\/watch?v=IiLDbrtBsn0","postType":"post","intro":"iOS 26 brings a fresh take on SwiftUI toolbars and modal presentations, and in this tutorial, I’ll guide you through everything you need to know. We’ll explore semantic and positional toolbar item placements, new glass button styles, toolbar spacers, and subtitle options—including some quirks to be aware of. You’ll also learn how to use the new matchGeometry transition with modal sheets for a polished, modern experience.\n\nBy the end of the video, you’ll be equipped to take full advantage of toolbars and sheet presentation enhancements in iOS 26.","postDate":"2025-09-14T00:00:00Z","title":"Mastering iOS 26 Toolbars & Modal Sheets in SwiftUI – New Glass Buttons, Transitions & More","postPlatform":"youtube"},{"additionalText":"","favoriteChoice":"no","id":"08B9DECF-5DB2-4F19-AD16-705ED2EE4EB7","author":"Stewart Lynch","studyLevel":"beginner","urlString":"https:\/\/www.youtube.com\/watch?v=E2nQsw0El8M","postType":"post","intro":"SwiftUI’s Liquid Glass effect in OS 26 is more than just eye candy—it’s a whole new design system. In this tutorial, I’ll guide you through the new button styles, applying glass effects to various views, and using GlassEffectContainer to create seamless, fluid layouts.\n\nWe’ll also explore namespace-powered unions, matched geometry transitions, and clever control interactions that elevate your app’s UI. This is hands-on, practical, and comprehensive.\n\nWhether you’re building for iOS, macOS, or visionOS, Liquid Glass is a game-changer—and I’ll help you get the most out of it.","postDate":"2025-08-31T00:00:00Z","title":"Mastering Liquid Glass in SwiftUI – Buttons, Containers & Transitions","postPlatform":"youtube"},{"additionalText":"","favoriteChoice":"no","id":"7AFE7711-BAC7-46A9-8995-EC8CB4EB9830","author":"Swiftful Thinking","studyLevel":"beginner","urlString":"https:\/\/www.youtube.com\/playlist?list=PLwvDm4VfkdpiLvzZFJI6rVIBtdolrJBVB","postType":"course","intro":"Get started with the Swift programming language. Write your first line of code and learn the fundamentals.","postDate":"2023-06-20T00:00:00Z","title":"Swift Basics","postPlatform":"youtube"},{"additionalText":"","favoriteChoice":"no","id":"45998FA9-26FC-4DC8-9B01-99A1B99BF270","author":"Swiftful Thinking","studyLevel":"beginner","urlString":"https:\/\/www.youtube.com\/playlist?list=PLwvDm4VfkdphqETTBf-DdjCoAvhai1QpO","postType":"course","intro":"The fastest way to learn SwiftUI. Learn how to build beautiful screens and other UI components.","postDate":"2021-02-03T00:00:00Z","title":"SwiftUI Bootcamp","postPlatform":"youtube"},{"additionalText":"","favoriteChoice":"no","id":"06A2B59B-031E-4A6D-B645-6BDBA42F4078","author":"Swiftful Thinking","studyLevel":"beginner","urlString":"https:\/\/www.youtube.com\/playlist?list=PLwvDm4VfkdpheGqemblOIA7v3oq0MS30i","postType":"course","intro":"Build your first app in SwiftUI! Learn how to build a real application with MVVM app architecture.","postDate":"2021-03-14T00:00:00Z","title":"SwiftUI Todo List","postPlatform":"youtube"},{"additionalText":"","favoriteChoice":"no","id":"19C71087-E458-46E5-A367-F2B1976B2D78","author":"Swiftful Thinking","studyLevel":"beginner","urlString":"https:\/\/www.youtube.com\/playlist?list=PLwvDm4VfkdpiALKk34l9mUS2f4mdJPvXq","postType":"course","intro":"A complete guide for learning how to use git. Practice using Source Control within Xcode, GitKraken, and Github. Get familiar with Git Flow.","postDate":"2024-04-29T00:00:00Z","title":"Git & Source Control","postPlatform":"youtube"},{"additionalText":"","favoriteChoice":"no","id":"B78CD0F5-5797-4339-A73C-B25E3145CAD5","author":"Swiftful Thinking","studyLevel":"beginner","urlString":"https:\/\/www.youtube.com\/playlist?list=PLwvDm4Vfkdpha5eVTjLM0eRlJ7-yDDwBk","postType":"course","intro":"Build a map app to showcase real destinations around the world. Get familiar with data management and transitions.","postDate":"2021-12-20T00:00:00Z","title":"SwiftUI Map App","postPlatform":"youtube"},{"additionalText":"","favoriteChoice":"no","id":"FA1EC525-10F1-4AE9-BB9D-5C43F92B59B9","author":"Swiftful Thinking","studyLevel":"middle","urlString":"https:\/\/www.youtube.com\/playlist?list=PLwvDm4VfkdpiagxAXCT33Rkwnc5IVhTar","postType":"course","intro":"Building professional apps requires knowledge of data persistence and networking. This bootcamp builds on your existing knowledge of SwiftUI.","postDate":"2021-03-29T00:00:00Z","title":"SwiftUI Continued Learning","postPlatform":"youtube"},{"additionalText":"","favoriteChoice":"no","id":"B180F099-A818-4F81-A4F2-7C772FFF9AFB","author":"Swiftful Thinking","studyLevel":"middle","urlString":"https:\/\/www.youtube.com\/playlist?list=PLwvDm4Vfkdphbc3bgy_LpLRQ9DDfFGcFu","postType":"course","intro":"Build a cryptocurrency app that downloads live price data from an API and saves the current user's portfolio. Get comfortable with Combine, Core Data, and MVVM.","postDate":"2021-05-24T00:00:00Z","title":"SwiftUI Crypto App","postPlatform":"youtube"},{"additionalText":"","favoriteChoice":"no","id":"13831EFA-A5C9-4BEF-9E10-A9464687C8B2","author":"Swiftful Thinking","studyLevel":"advanced","urlString":"https:\/\/www.youtube.com\/playlist?list=PLwvDm4Vfkdphc1LLLjCaEd87BEg07M97y","postType":"course","intro":"Learn how to build custom views, animations, and transitions. Get familiar with coding techniques such as Dependency Injection and Protocol-Oriented Programming. Write your first unit tests and connect to CloudKit.","postDate":"2021-08-30T00:00:00Z","title":"SwiftUI Advanced Learning","postPlatform":"youtube"},{"favoriteChoice":"no","id":"D97DA75A-D197-4E90-8F15-D5A216A1242C","author":"www.atlassian.com","studyLevel":"beginner","urlString":"https:\/\/www.atlassian.com\/git\/tutorials","postType":"post","intro":"The source contains tutorials on merging and rebasing, resetting, checking out, reverting, and other usefull guides, in Git.","additionalText":"","title":"Tips to Git","postPlatform":"youtube"},{"additionalText":"","favoriteChoice":"no","id":"60E9CCA4-C18A-4DD1-A429-1DD8F3BE01F0","author":"Anton @Toshhhh","studyLevel":"middle","urlString":"https:\/\/habr.com\/ru\/companies\/banki\/articles\/958650\/","postType":"post","intro":"Привет! Меня зовут Антон, я iOS-разработчик в Банки.ру. Когда я только начинал изучать Combine, он казался для меня магией. Пара команд и вот у тебя уже есть какие-то данные. Чтобы Combine перестал оставаться черным ящиком давайте заглянем внутрь. Эта статья – мое виденье этого фреймворка.","postDate":"2025-10-22T00:00:00Z","title":"Combine – швейцарский нож iOS-разработчика. Или нет?","postPlatform":"website"},{"additionalText":"","favoriteChoice":"no","id":"612A38CD-C517-40D5-BE91-6F2CE7121DC1","author":"Andrey @SovcomTech","studyLevel":"middle","urlString":"https:\/\/habr.com\/ru\/companies\/sovcombank_technologies\/articles\/956112\/","postType":"post","intro":"Привет! Я – Андрей, QA-лид из компании «Совкомбанк Технологии».\n        \nХочу поделиться опытом тестировании мобильных приложений в Xcode — среде, которую многие используют только для разработки. По внутренним данным нашей компании, примерно 65% критических багов в iOS-приложениях можно выловить ещё на этапе разработки, если грамотно использовать встроенные инструменты Xcode.","postDate":"2025-10-14T00:00:00Z","title":"Xcode: ключевые инструменты для ручного тестирования мобильных приложений","postPlatform":"website"},{"additionalText":"","favoriteChoice":"no","id":"A6A0F85D-B493-496D-AD24-7DD9FBEF2074","author":"Fatbobman","studyLevel":"beginner","urlString":"https:\/\/fatbobman.com\/en\/posts\/list-or-lazyvstack\/","postType":"post","intro":"In the world of SwiftUI, List and LazyVStack, as two core lazy containers, offer robust support for developers to display large amounts of data. However, their similar performance in certain scenarios often causes confusion among developers when making a choice. This article aims to analyze the characteristics and advantages of these two components to help you make a better decision.","postDate":"2024-07-10T00:00:00Z","title":"List or LazyVStack: Choosing the Right Lazy Container in SwiftUI","postPlatform":"website"},{"additionalText":"","favoriteChoice":"no","id":"73C29ADE-9CD2-44A0-8E2A-915D4D054F5D","author":"John Sundell","studyLevel":"beginner","urlString":"https:\/\/www.swiftbysundell.com\/articles\/encapsulating-swiftui-view-styles\/","postType":"post","intro":"Regardless of what framework or tool that’s used to build a given UI, finding a good way to separate the structure and internal logic of our various views from the styles that are being applied to them is often key in order to make UI code easier to maintain and manage.\n\nWhile certain technologies offer a quite natural way of separating those two aspects of UI development, such as how websites declare their structure through HTML and their styles using CSS — when it comes to SwiftUI, it might not initially seem like that kind of separation is practical, or even encouraged.\n\nHowever, if we start exploring SwiftUI’s various APIs and conventions a bit further, it turns out that there are a number of tools and techniques that we can use to create a clean separation between our view hierarchy, its styles, and the components that we’re looking to reuse across a given project.\n\nThat’s exactly what we’ll take a look at in this week’s article.","postDate":"2020-09-27T00:00:00Z","title":"Encapsulating SwiftUI view styles","postPlatform":"website"}
    ]
}
